/*
  Каталог тестов. Для каждого теста используется уникальный id.
  Примечание: ответы доступны в исходном JavaScript на статическом сайте.
*/
window.TESTS = [
  {
    id: "surgery",
    title: "Тест по хирургии",
    description: "Проверка знаний по хирургии.",
    timeLimit: 7,
    passPercent: 80,
    shuffleQuestions: true,
    shuffleAnswers: true,
    theme: "surgery",
    questions: [
      {
        id: "surgery_001",
        question: "Что нужно сделать перед операцией?",
        type: "multiple",
        answers: ["Подписать форму согласия", "Надеть чистые мед.перчатки", "Подготовить хирургические инструменты", "Если пациенту больно, то нужно дать обезболивающее. Если пациенту очень больно и вы будете его резать, то нужен наркоз", "Сообщить в рацию о начале операции", "Пригласить священника", "Ввести успокоительное пациенту"],
        correct: [0, 1, 2, 3],
        points: 1
      },
      {
        id: "surgery_002",
        question: "Имеет ли право хирург делать операцию в ночную смену?",
        type: "single",
        answers: ["Да", "Нет, запрещено уставом Больницы"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_003",
        question: "В каких случаях можно отказать в проведении операции?",
        type: "multiple",
        answers: ["Аморальное поведение", "Угроза жизни сотруднику", "Отказ от регламентированной оплаты лечения", "Неуважительное общение по отношению сотруднику", "Отказ от подписания формы согласия", "Если человек молчит и не слышит"],
        correct: [0, 1, 2, 3, 4],
        points: 1
      },
      {
        id: "surgery_004",
        question: "Можно ли требовать свою цену за операцию или какое либо другое хирургическое вмешательство?",
        type: "single",
        answers: ["Можно, если услуги не указаны в регламентированном прейскуранте организации", "Можно, врачи мало получают", "Можно, если пациент делает комплекс операций"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_005",
        question: "Для чего нужна форма согласия?",
        type: "single",
        answers: ["Для предотвращения дальнейших юридических последствий", "Просто потому что так нужно", "Чтобы получить подпись", "Так спокойнее"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_006",
        question: "Имеет ли право медик без квалификации хирурга делать операции?",
        type: "single",
        answers: ["Нет", "Да", "Да, если операция экстренная", "Да, если нет медика с квалификацией"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_007",
        question: "Для чего нужна анестезия?",
        type: "single",
        answers: ["Процедура, использующаяся для обезболивания во время хирургического вмешательства", "Для ускорения заживления ран", "Для ускорения регенерации тканей после операции", "Что бы пациент наблюдал за хирургическим вмешательством"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_008",
        question: "Какие есть виды переломов?",
        type: "single",
        answers: ["Открытый и закрытый", "Простой и сложный", "Поверхностный и глубокий", "Явный и скрытый"],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_009",
        question: "В каком канале взять цены на операции?",
        type: "single",
        answers: ['Канал "Прайс-лист"', 'Канал "Цены-хирургии"', 'Канал "Памятка-хирургии"', 'Канал "Цены-операции"'],
        correct: [0],
        points: 1
      },
      {
        id: "surgery_010",
        question: "Выберите верную последовательность:",
        type: "single",
        answers: ["Поступил пациент с жалобой на перелом > сделать рентген > дать пациенту на подпись форму согласия > взять с пациента оплату за наложение гипса > произвести наложение гипса", "Поступил пациент с жалобой на перелом > дать пациенту на подпись форму согласия > сделать рентген > взять с пациента оплату за наложение гипса > произвести наложение гипса", "Поступил пациент с жалобой на перелом > сделать рентген > дать пациенту на подпись форму согласия > произвести наложение гипса > взять с пациента оплату за наложение гипса", "Поступил пациент с жалобой на перелом > сделать рентген > дать пациенту на подпись форму согласия > взять с пациента 10к за гипс > произвести наложение гипса"],
        correct: [0],
        points: 1
      }
    ]
  },
  {
    id: "certification-db",
    title: "Переаттестация ДБ",
    description: "Проверка знаний по уставу",
    timeLimit: 10,
    passPercent: 80,
    shuffleQuestions: true,
    shuffleAnswers: true,
    theme: "training",
    questions: [
      { 
        id: 'db_001', 
        question: 'При оказании экстренной медицинской помощи Вы прибыли на место происшествия, где находятся несколько пострадавших с различными травмами. Один из пострадавших является сотрудником государственной структуры и находится в служебной форме. Кому необходимо оказать помощь в первую очередь?', 
        type: 'single', 
        answers: ['Пострадавшему, находящемуся в наиболее тяжёлом состоянии', 'Сотруднику государственной структуры', 'Приоритетов в оказании первой медицинской помощи нет', 'Ближайшему к вам пострадавшему'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_002', 
        question: 'Какие временные рамки имеются у сотрудников на перерыв для отдыха и питания?', 
        type: 'single', 
        answers: ['Не менее 1 часа и не более 2 часов при условии, что сотрудник находился до этого на рабочем месте не менее чем 2 часа', 'Не менее 2 часа и не более 3 часов при условии, что сотрудник находился до этого на рабочем месте не менее чем 2 часа', 'Не менее 1 часа и не более 3 часов', 'Не менее 30 минут и не более 1 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_003', 
        question: 'Подъезжая к месту оказания первой медицинской помощи вы обнаружили на земле Огнестрельное оружие, и рядом с местом Оказания первой медицинской помощи вы видите вооруженных лиц которые ведут перестрелку. Как вы поступите?', 
        type: 'single', 
        answers: ['Покину данное место ввиду того что там происходит перестрелка и оказать какую либо помощь я не смогу', 'Подойду вплотную к месту и начну оказывать первую медицинскую помощь пострадавшим', 'Подниму огнестрельное оружие и начну стрелять в вооруженных лиц, так как у меня имеется действующая лицензия на оружие'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_004', 
        question: 'Сколько квалификации имеется в Больнице?', 
        type: 'single', 
        answers: ['4 Квалификации', '3 Квалификации', '5 Квалификации', '6 Квалификации'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_005', 
        question: 'В течении какого времени сотрудник обязан пройти назначенную ему переаттестацию?', 
        type: 'single', 
        answers: ['48 часов', '24 часа', '72 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_006', 
        question: 'Нормы взятия медикаментов и индивидуальных предметов?', 
        type: 'single', 
        answers: ['Парацетамол - 48 шт;\nЭпинефрин - 20 шт;\nАктивированный уголь - 24 шт;\nАзитромицин - 24 шт;\nИндивидуальный рацион питания (ИРП) - 3 шт на 3 часа', 'Парацетамол - 48 шт;\nЭпинефрин - 10 шт;\nАктивированный уголь - 24 шт;\nАзитромицин - 24 шт;\nИндивидуальный рацион питания (ИРП) - 3 шт на 1 часа', 'Парацетамол - 72 шт;\nЭпинефрин - 35 шт;\nАктивированный уголь - 14 шт;\nАзитромицин - 14 шт;\nИндивидуальный рацион питания (ИРП) - 1 шт на 2 часа', 'Парацетамол - 24 шт;\nЭпинефрин - 10 шт;\nАктивированный уголь - 20 шт;\nАзитромицин - 20 шт;\nИндивидуальный рацион питания (ИРП) - 2 шт на 3 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_007', 
        question: 'Какой рабочий график организации Больницы?', 
        type: 'single', 
        answers: ['Дневная смена:\nПонедельник-пятница: с 9:00 до 20:00\nСуббота-воскресенье: с 9:00 до 18:00\nНочная смена:\nПонедельник-пятница: с 20:00 до 9:00\nСуббота-воскресенье: с 18:00 до 9:00', 'Дневная смена:\nПонедельник-пятница: с 11:00 до 22:00\nСуббота-воскресенье: с 12:00 до 22:00\nНочная смена:\nПонедельник-пятница: с 22:00 до 11:00\nСуббота-воскресенье: с 22:00 до 12:00', 'Дневная смена:\nПонедельник-пятница: с 9:00 до 22:00\nСуббота-воскресенье: с 10:00 до 22:00\nНочная смена:\nПонедельник-пятница: с 22:00 до 9:00\nСуббота-воскресенье: с 22:00 до 10:00'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_008', 
        question: 'Какова минимальная суточная норма которую необходимо выполнить сотруднику?', 
        type: 'single', 
        answers: ['4 часа', '5 часов', '2 часа', 'Нормы рабочего времени отсутствует'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_009', 
        question: 'Разрешен ли выезд на личном транспортном средстве для оказания первой медицинской помощи?', 
        type: 'single', 
        answers: ['Запрещено', 'Разрешено если личное транспортном средство бело-красного цвета', 'Разрешено'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_010', 
        question: 'Какую квалификацию обязан получить сотрудник Больницы при повышении на 9-й порядковый ранг?', 
        type: 'single', 
        answers: ['Квалификация "Хирурга и Мед.карты"', 'Квалификация "Вакцин"', 'Квалификация "Психолог"', 'Квалификация "Терапевт"'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_011', 
        question: 'Обязан ли сотрудник находится в спец.связи (дискорд) организации', 
        type: 'single', 
        answers: ['Да, обязан', 'Нет, не обязан'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'db_012', 
        question: 'В течении какого времени сотрудник организации по прибытию в штат обязан приступить к исполнению служебных обязанностей и составить отчет о начале рабочей смены', 
        type: 'single', 
        answers: ['В течении 10 минут', 'В течении 15 минут', 'В течении 30 минут'], 
        correct: [0], 
        points: 1 
      }
    ]
  },
  {
    id: "certification",
    title: "Переаттестация",
    description: "Проверка знаний по уставу",
    timeLimit: 13,
    passPercent: 80,
    shuffleQuestions: true,
    shuffleAnswers: true,
    theme: "admin",
    questions: [
            { 
        id: 'cert_001', 
        question: 'При оказании экстренной медицинской помощи Вы прибыли на место происшествия, где находятся несколько пострадавших с различными травмами. Один из пострадавших является сотрудником государственной структуры и находится в служебной форме. Кому необходимо оказать помощь в первую очередь?', 
        type: 'single', 
        answers: ['Пострадавшему, находящемуся в наиболее тяжёлом состоянии', 'Сотруднику государственной структуры', 'Приоритетов в оказании первой медицинской помощи нет', 'Ближайшему к вам пострадавшему'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_002', 
        question: 'Какие временные рамки имеются у сотрудников на перерыв для отдыха и питания?', 
        type: 'single', 
        answers: ['Не менее 1 часа и не более 2 часов при условии, что сотрудник находился до этого на рабочем месте не менее чем 2 часа', 'Не менее 2 часа и не более 3 часов при условии, что сотрудник находился до этого на рабочем месте не менее чем 2 часа', 'Не менее 1 часа и не более 3 часов', 'Не менее 30 минут и не более 1 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_003', 
        question: 'Подъезжая к месту оказания первой медицинской помощи вы обнаружили на земле Огнестрельное оружие, и рядом с местом Оказания первой медицинской помощи вы видите вооруженных лиц которые ведут перестрелку. Как вы поступите?', 
        type: 'single', 
        answers: ['Покину данное место ввиду того что там происходит перестрелка и оказать какую либо помощь я не смогу', 'Подойду вплотную к месту и начну оказывать первую медицинскую помощь пострадавшим', 'Подниму огнестрельное оружие и начну стрелять в вооруженных лиц, так как у меня имеется действующая лицензия на оружие'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_004', 
        question: 'Сколько квалификации имеется в Больнице?', 
        type: 'single', 
        answers: ['4 Квалификации', '3 Квалификации', '5 Квалификации', '6 Квалификации'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_005', 
        question: 'В течении какого времени сотрудник обязан пройти назначенную ему переаттестацию?', 
        type: 'single', 
        answers: ['48 часов', '24 часа', '72 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_006', 
        question: 'Нормы взятия медикаментов и индивидуальных предметов?', 
        type: 'single', 
        answers: ['Парацетамол - 48 шт;\nЭпинефрин - 20 шт;\nАктивированный уголь - 24 шт;\nАзитромицин - 24 шт;\nИндивидуальный рацион питания (ИРП) - 3 шт на 3 часа', 'Парацетамол - 48 шт;\nЭпинефрин - 10 шт;\nАктивированный уголь - 24 шт;\nАзитромицин - 24 шт;\nИндивидуальный рацион питания (ИРП) - 3 шт на 1 часа', 'Парацетамол - 72 шт;\nЭпинефрин - 35 шт;\nАктивированный уголь - 14 шт;\nАзитромицин - 14 шт;\nИндивидуальный рацион питания (ИРП) - 1 шт на 2 часа', 'Парацетамол - 24 шт;\nЭпинефрин - 10 шт;\nАктивированный уголь - 20 шт;\nАзитромицин - 20 шт;\nИндивидуальный рацион питания (ИРП) - 2 шт на 3 часа'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_007', 
        question: 'Какой рабочий график организации Больницы?', 
        type: 'single', 
        answers: ['Дневная смена:\nПонедельник-пятница: с 9:00 до 20:00\nСуббота-воскресенье: с 9:00 до 18:00\nНочная смена:\nПонедельник-пятница: с 20:00 до 9:00\nСуббота-воскресенье: с 18:00 до 9:00', 'Дневная смена:\nПонедельник-пятница: с 11:00 до 22:00\nСуббота-воскресенье: с 12:00 до 22:00\nНочная смена:\nПонедельник-пятница: с 22:00 до 11:00\nСуббота-воскресенье: с 22:00 до 12:00', 'Дневная смена:\nПонедельник-пятница: с 9:00 до 22:00\nСуббота-воскресенье: с 10:00 до 22:00\nНочная смена:\nПонедельник-пятница: с 22:00 до 9:00\nСуббота-воскресенье: с 22:00 до 10:00'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_008', 
        question: 'Какова минимальная суточная норма которую необходимо выполнить сотруднику?', 
        type: 'single', 
        answers: ['4 часа', '5 часов', '2 часа', 'Нормы рабочего времени отсутствует'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_009', 
        question: 'Разрешен ли выезд на личном транспортном средстве для оказания первой медицинской помощи?', 
        type: 'single', 
        answers: ['Запрещено', 'Разрешено если личное транспортном средство бело-красного цвета', 'Разрешено'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_010', 
        question: 'Какую квалификацию обязан получить сотрудник Больницы при повышении на 9-й порядковый ранг?', 
        type: 'single', 
        answers: ['Квалификация "Хирурга и Мед.карты"', 'Квалификация "Вакцин"', 'Квалификация "Психолог"', 'Квалификация "Терапевт"'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_011', 
        question: 'Обязан ли сотрудник находится в спец.связи (дискорд) организации', 
        type: 'single', 
        answers: ['Да, обязан', 'Нет, не обязан'], 
        correct: [0], 
        points: 1 
      },
      { 
        id: 'cert_012', 
        question: 'В течении какого времени сотрудник организации по прибытию в штат обязан приступить к исполнению служебных обязанностей и составить отчет о начале рабочей смены', 
        type: 'single', 
        answers: ['В течении 10 минут', 'В течении 15 минут', 'В течении 30 минут'], 
        correct: [0], 
        points: 1 
      },
      {
        id: 'cert_013',
        question: 'Какие отделения существуют в больнице?',
        type: 'multiple',
        answers: ['ОПП', 'ОМП', 'ПСЭО', 'АБ', 'ПСИД', 'ПМ', 'ДИ'],
        correct: [0, 1, 2, 3],
        points: 1
      },
      {
        id: 'cert_014',
        question: 'На сколько дней сотрудник может взять отпуск в 1 календарный месяц?',
        type: 'single',
        answers: ['7 дней', '5 дней', '3 дня', '14 дней'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_015',
        question: 'Разрешено ли сотруднику больницы оказывать первую медицинскую помощь во время перестрелки',
        type: 'single',
        answers: ['Нет, запрещено', 'Да, разрешено'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_016',
        question: 'Какое оружие сотрудник может использовать во время смены в качестве исключения?',
        type: 'single',
        answers: ['Нож для служебной деятельности или самооборона', 'Пистолет для защиты имущества', 'Бронежилет при вызове', 'Любое оружие при угрозе пациенту'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_017',
        question: 'Входят ли часы ночной смены в минимальную суточную норму в 4 часа?',
        type: 'single',
        answers: ['Нет, ночная смена не входит в минимальную норму', 'Да, полностью', 'Только для младшего состава'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_018',
        question: 'Можно ли повышаться при наличии активного взыскания?',
        type: 'single',
        answers: ['Нет', 'Да, если сотрудник выполнил норму', 'Да'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_019',
        question: 'В течение какого времени сотрудник обязан отработать взыскание после его выдачи?',
        type: 'single',
        answers: ['48 часов', '36 часов', '24 часа', '72 часа'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_020',
        question: 'Кто освобождается от обязательного посещения брифинга?',
        type: 'single',
        answers: ['Интерны 1 ранга, сотрудники c оформленным обеденным перерывом, а также сотрудники с заранее оформленным отпуском', 'Cотрудники, выполнившие норму часов', 'Сотрудники, находящиеся в здании больницы'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_021',
        question: 'Где в ГКБ имени Склифосовского находятся кабинеты выдачи медицинских карт?',
        type: 'single',
        answers: ['На втором этаже, в кабинетах 201 и 202', 'На первом этаже, в кабинетах 102 и 104', 'На первом этаже, в регистратуре', 'На втором этаже, в кабинете 104'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_022',
        question: 'Где в ГКБ имени Склифосовского проводится вакцинация?',
        type: 'single',
        answers: ['В кабинетах 102 и 104 первого этажа', 'В кабинетах 201 и 202', 'В регистратуре', 'Только в холле'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_023',
        question: 'В каких кабинетах ГКБ выдаются медицинские карты?',
        type: 'single',
        answers: ['На первом этаже, в кабинетах терапевтов', 'На первом этаже, в кабинете психолога"', 'На первом этаже, в кабинете хирурга'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_024',
        question: 'Где в ГКБ проводится вакцинация?',
        type: 'single',
        answers: ['На первом этаже, в кабинетах терапевтов', 'На первом этаже, в кабинете психолога"', 'На первом этаже, в кабинете хирурга'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_025',
        question: 'Где разрешено выдавать парацетамол?',
        type: 'single',
        answers: ['В холлах на территории больниц исключительно у регистратуры', 'В любом кабинете больницы', 'Только в операционной', 'На месте вызова ПМП'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_026',
        question: 'Что происходит с сотрудником при назначении переаттестации?',
        type: 'single',
        answers: ['Он отстраняется от служебных полномочий и не может пользоваться складом и транспортом, но должен присутствовать на смене', 'Он продолжает работать без ограничений', 'Он может работать только ночью'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_027',
        question: 'С какого ранга обычно разрешен перевод в другое отделение?',
        type: 'single',
        answers: ['С 5-го ранга, для перевода в ПСЭО требуется не менее 7-го ранга', 'С 9 ранга', 'С 2 ранга', 'С 3 ранга'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_028',
        question: 'Разрешено ли использовать эпинефрин без дефибриллятора?',
        type: 'single',
        answers: ['Запрещено', 'Разрешено'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_029',
        question: 'Обязан ли сотрудник соблюдать дресс-код своего отделения?',
        type: 'single',
        answers: ['Да, обязан', 'Нет, не обязан'],
        correct: [0],
        points: 1
      },
      {
        id: 'cert_030',
        question: 'Обязан ли сотрудник надеть боди-камеру?',
        type: 'single',
        answers: ['Да, Обязан, а также включить его для фиксации', 'Да, Обязан', 'На усмотрение сотрудника', 'Нет, не обязан'],
        correct: [0],
        points: 1
      }
    ]
  }
];
